ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_tps.c
#ifdef CY_BLE_TPS_SERVER

/******************************************************************************
* Function Name: cy_ble_TpssWriteEventHandler
***************************************************************************//**
*
*  Handles the Write Request Event for Tx Power service.
*
*  \param cy_stc_ble_gatts_write_cmd_req_param_t * eventParam: The pointer to the data that came
*                                               with a write request for TPS.
*
* \return
*  Return value is of type cy_en_ble_gatt_err_code_t.
*   * CY_BLE_GATT_ERR_NONE - Write is successful.
*   * CY_BLE_GATT_ERR_REQUEST_NOT_SUPPORTED - Request is not supported.
*   * CY_BLE_GATT_ERR_INVALID_HANDLE - 'handleValuePair.attrHandle' is not valid.
*   * CY_BLE_GATT_ERR_WRITE_NOT_PERMITTED - Write operation is not permitted on
*                                          this attribute.
*   * CY_BLE_GATT_ERR_INVALID_OFFSET - Offset value is invalid.
*   * CY_BLE_GATT_ERR_UNLIKELY_ERROR - Some other error occurred.
*
******************************************************************************/
static cy_en_ble_gatt_err_code_t Cy_BLE_TPSS_WriteEventHandler(const cy_stc_ble_gatts_write_cmd_req_param_t *eventParam)
{
    cy_en_ble_gatt_err_code_t gattErr = CY_BLE_GATT_ERR_NONE;
    uint32_t event = (uint32_t)CY_BLE_EVT_TPSS_NOTIFICATION_DISABLED;


    /* Check event code if it defines write request */
    if(NULL != Cy_BLE_TPS_ApplCallback)
    {
        /* Client Characteristic Configuration descriptor write request */
        if(eventParam->handleValPair.attrHandle == cy_ble_tpsConfigPtr->tpss->txPowerLevelCccdHandle)
        {
            /* Verify that optional notification property is enabled for Tx Power Level characteristic */
            if(CY_BLE_IS_NOTIFICATION_SUPPORTED(cy_ble_tpsConfigPtr->tpss->txPowerLevelCharHandle))
            {
                cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
                {
                    .handleValuePair = eventParam->handleValPair,
                    .connHandle      = eventParam->connHandle,
                    .offset          = 0u,
                    .flags           = CY_BLE_GATT_DB_PEER_INITIATED
                };
                gattErr = Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo);

                if(CY_BLE_IS_NOTIFICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
                {
                    event = (uint32_t)CY_BLE_EVT_TPSS_NOTIFICATION_ENABLED;
                }

                if(gattErr == CY_BLE_GATT_ERR_NONE)
                {
                    cy_stc_ble_tps_char_value_t wrReqParam =
                    {
                        .connHandle = eventParam->connHandle,
                        .charIndex  = CY_BLE_TPS_TX_POWER_LEVEL,
                        .value      = NULL
                    };
                    Cy_BLE_TPS_ApplCallback(event, (void*)&wrReqParam);
                }
            }
            else
            {
                gattErr = CY_BLE_GATT_ERR_REQUEST_NOT_SUPPORTED;
            }
            /* Indicate that request was handled */
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
    }

    return(gattErr);
}


/******************************************************************************
* Function Name: cy_ble_TpssSetCharacteristicValue
***************************************************************************//**
*
*  Sets characteristic value of the Tx Power Service, which is identified by
*  charIndex.
*
*  \param charIndex: The index of the service characteristic.
*  \param attrSize: The size of the characteristic value attribute.
*  \param attrValue: The pointer to the characteristic value data that should be
*               stored in the GATT database.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*   * CY_BLE_SUCCESS - The characteristic value was read successfully.
*   * CY_BLE_ERROR_INVALID_PARAMETER - Validation of input parameters failed.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_TPSS_SetCharacteristicValue(cy_en_ble_tps_char_index_t charIndex,
                                                          uint8_t attrSize,
                                                          int8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_ERROR_INVALID_PARAMETER;

    if(charIndex < CY_BLE_TPS_CHAR_COUNT)
    {
        /* Set Tx Power Level characteristic value to GATT database. Need to handle return type difference of
         * Cy_BLE_GATTS_WriteAttributeValueCCCD() and cy_ble_tpssSetCharacteristicValue(). */
        cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
        {
            .handleValuePair.attrHandle = cy_ble_tpsConfigPtr->tpss->txPowerLevelCharHandle,
            .handleValuePair.value.len  = attrSize,
            .handleValuePair.value.val  = (uint8_t*)attrValue,
            .offset                     = 0u,
            .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
        };
        if(Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo) == CY_BLE_GATT_ERR_NONE)
        {
            /* Indicate success */
            apiResult = CY_BLE_SUCCESS;
        }
        
    }

    /* Return status */
    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_TPSS_GetCharacteristicValue
***************************************************************************//**
*
*  Gets characteristic value of the Tx Power Service, which is identified by
*  charIndex.
*
*  \param charIndex: The index of the Tx Power characteristic.
*  \param attrSize: The size of the Tx Power characteristic value attribute.
*  \param attrValue: The pointer to the location where Tx Power characteristic
*               value data should be stored.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*   * CY_BLE_SUCCESS - Characteristic value was read successfully
*   * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameters failed
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_TPSS_GetCharacteristicValue(cy_en_ble_tps_char_index_t charIndex,
                                                          uint8_t attrSize,
                                                          int8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_ERROR_INVALID_PARAMETER;

