ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_tps.c
    if((attrValue != NULL) && (charIndex == CY_BLE_TPS_TX_POWER_LEVEL) && (attrSize == CY_BLE_TPS_TX_POWER_LEVEL_SIZE))
    {
        cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
        {
            .handleValuePair.attrHandle = cy_ble_tpsConfigPtr->tpss->txPowerLevelCharHandle,
            .handleValuePair.value.len  = attrSize,
            .handleValuePair.value.val  = (uint8_t*)attrValue,
            .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
        };
        /* Get Tx Power Level characteristic value from GATT database */
        if(Cy_BLE_GATTS_ReadAttributeValueCCCD(&dbAttrValInfo) == CY_BLE_GATT_ERR_NONE)
        {
            /* Indicate success */
            apiResult = CY_BLE_SUCCESS;
        }
    }

    /* Return status */
    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_TPSS_GetCharacteristicDescriptor
***************************************************************************//**
*
*  Gets characteristic descriptor of specified characteristic of the Tx Power
*  Service.
*
*  \param connHandle: The connection handle
*  \param charIndex: The index of the characteristic.
*  \param descrIndex: The index of the descriptor.
*  \param attrSize: The size of the characteristic value attribute.
*  \param attrValue: The pointer to the location where characteristic descriptor value
*               data should be stored.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*   * CY_BLE_SUCCESS - Characteristic Descriptor value was read successfully
*   * CY_BLE_ERROR_INVALID_PARAMETER - Validation of input parameters failed
*   * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - Optional descriptor is absent
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_TPSS_GetCharacteristicDescriptor(cy_stc_ble_conn_handle_t connHandle,
                                                               cy_en_ble_tps_char_index_t charIndex,
                                                               cy_en_ble_tps_char_descriptors_t descrIndex,
                                                               uint8_t attrSize,
                                                               uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_ERROR_INVALID_PARAMETER;

    if((charIndex == CY_BLE_TPS_TX_POWER_LEVEL) && (descrIndex == CY_BLE_TPS_CCCD))
    {
        if(CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE != cy_ble_tpsConfigPtr->tpss->txPowerLevelCccdHandle)
        {
            /* Set Client Characteristic Configuration Descriptor of Tx Power Level
             *  characteristic to GATT database.
             *  Need to handle return type difference of Cy_BLE_GATTS_WriteAttributeValueCCCD() and
             *  cy_ble_TpssGetCharacteristicDescriptor(). */
            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
            {
                .handleValuePair.attrHandle = cy_ble_tpsConfigPtr->tpss->txPowerLevelCccdHandle,
                .handleValuePair.value.len  = attrSize,
                .handleValuePair.value.val  = (uint8_t*)attrValue,
                .connHandle                 = connHandle,
                .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
            };
            if(Cy_BLE_GATTS_ReadAttributeValueCCCD(&dbAttrValInfo) == CY_BLE_GATT_ERR_NONE)
            {
                /* Indicate success */
                apiResult = CY_BLE_SUCCESS;
            }
        }
        else
        {
            apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
        }
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_TPSS_SendNotification
***************************************************************************//**
*
*  Sends a notification with the characteristic value, as specified by charIndex,
*  to the Client device.
*
*  On enabling notification successfully for a service characteristic it sends out a
*  'Handle Value Notification' which results in CY_BLE_EVT_TPSC_NOTIFICATION event
*  at the GATT Client's end.
*
*  \param connHandle: The connection handle.
*  \param charIndex: The index of the service characteristic.
*  \param attrSize: The size of the characteristic value attribute.
*  \param attrValue: The pointer to the characteristic value data that should be
*               sent to the client's device.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*   * CY_BLE_SUCCESS - The request handled successfully.
*   * CY_BLE_ERROR_INVALID_PARAMETER - Validation of input parameter failed.
*   * CY_BLE_ERROR_INVALID_OPERATION - Operation is invalid for this.
*                                      characteristic.
*   * CY_BLE_ERROR_INVALID_STATE - Connection with client is not established.
*   * CY_BLE_ERROR_NTF_DISABLED - Notification is not enabled by the client.
*   * CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED - Memory allocation failed.
*
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_TPSS_SendNotification(cy_stc_ble_conn_handle_t connHandle,
                                                    cy_en_ble_tps_char_index_t charIndex,
                                                    uint8_t attrSize,
                                                    int8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_ERROR_INVALID_PARAMETER;

    if((attrValue != NULL) && (charIndex == CY_BLE_TPS_TX_POWER_LEVEL) && (attrSize == CY_BLE_TPS_TX_POWER_LEVEL_SIZE))
    {
        if(CY_BLE_IS_NOTIFICATION_ENABLED(connHandle.attId, cy_ble_tpsConfigPtr->tpss->txPowerLevelCccdHandle))
        {
            /* Set Tx Power Level characteristic value to GATT database.
             *  Need to handle return type difference of Cy_BLE_GATTS_WriteAttributeValueCCCD() and
             *  cy_ble_tpssSetCharacteristicValue(). */
            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
            {
                .handleValuePair.attrHandle = cy_ble_tpsConfigPtr->tpss->txPowerLevelCharHandle,
                .handleValuePair.value.val  = (uint8_t*)attrValue,
                .handleValuePair.value.len  = attrSize,
                .connHandle                 = connHandle,
                .offset                     = 0u,
                .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
            };
            if(Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo) == CY_BLE_GATT_ERR_NONE)
            {
                if(Cy_BLE_GetConnectionState(connHandle) < CY_BLE_CONN_STATE_CONNECTED)
                {
                    apiResult = CY_BLE_ERROR_INVALID_STATE;
                }
                else
                {
                    /* Fill all fields of write request structure ... */
                    cy_stc_ble_gatts_handle_value_ntf_t ntfReqParam =
                    {
                        .handleValPair.attrHandle = dbAttrValInfo.handleValuePair.attrHandle,
                        .handleValPair.value.val  = dbAttrValInfo.handleValuePair.value.val,
                        .handleValPair.value.len  = dbAttrValInfo.handleValuePair.value.len,
                        .connHandle               = connHandle
                    };
                    /* Send notification to client using previously filled structure */
                    apiResult = Cy_BLE_GATTS_Notification(&ntfReqParam);
                }
            }
        }
        else
        {
            apiResult = CY_BLE_ERROR_NTF_DISABLED;
        }
    }

    /* Return status */
    return(apiResult);
}

#endif /* (CY_BLE_GATT_ROLE_SERVER) */


#ifdef CY_BLE_TPS_CLIENT

