ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_tps.c
/******************************************************************************
* Function Name: Cy_BLE_TPSC_DiscoverCharacteristicsEventHandler
***************************************************************************//**
*
*  This function is called on receiving a CY_BLE_EVT_GATTC_READ_BY_TYPE_RSP event.
*  Based on the service UUID, an appropriate data structure is populated using the
*  data received as part of the callback.
*
*  \param cy_stc_ble_disc_char_info_t * discCharInfo: The pointer to the characteristic
*                                          information structure.
*
*
******************************************************************************/
static void Cy_BLE_TPSC_DiscoverCharacteristicsEventHandler(cy_stc_ble_disc_char_info_t *discCharInfo)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(discCharInfo->connHandle);

    if((discCharInfo->uuidFormat == CY_BLE_GATT_16_BIT_UUID_FORMAT) &&
       (cy_ble_discovery[discIdx].servCount == (uint32_t)CY_BLE_SRVI_TPS))
    {
        if(discCharInfo->uuid.uuid16 == CY_BLE_UUID_CHAR_TX_POWER_LEVEL)
        {
            /* Save Tx Power Level Characteristic handle */
            Cy_BLE_CheckStoreCharHandle(cy_ble_tpsc[discIdx].txPowerLevelChar);
        }

        /* Indicate that request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
}


/******************************************************************************
* Function Name: Cy_BLE_TPSC_DiscoverCharDescriptorsEventHandler
***************************************************************************//**
*
*  This function is called on receiving a CY_BLE_EVT_GATTC_FIND_INFO_RSP event.
*  This event is generated when a server successfully sends the data for
*  CY_BLE_EVT_GATTC_FIND_INFO_REQ. Based on the service UUID, an appropriate data
*  structure is populated to the service with a service callback.
*
*  \param cy_stc_ble_disc_descr_info_t * discDescrInfo: The pointer to descriptor information
*                                            structure.
*
******************************************************************************/
static void Cy_BLE_TPSC_DiscoverCharDescriptorsEventHandler(cy_stc_ble_disc_descr_info_t *discDescrInfo)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(discDescrInfo->connHandle);

    if(cy_ble_discovery[discIdx].servCount == (uint32_t)CY_BLE_SRVI_TPS)
    {
        if(discDescrInfo->uuid.uuid16 == CY_BLE_UUID_CHAR_CLIENT_CONFIG)
        {
            Cy_BLE_CheckStoreCharDescrHandle(cy_ble_tpsc[discIdx].txPowerLevelCccdHandle);
        }

        /* Indicate that request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
}


/******************************************************************************
* Function Name: Cy_BLE_TPSC_GetCharRange
***************************************************************************//**
*
* Returns a possible range of the current characteristic descriptor via
* input parameter charRangeInfo->range
*
* \param *charRangeInfo: The pointer to a descriptor range information structure.
* \return
*  None.
*
******************************************************************************/
static void Cy_BLE_TPSC_GetCharRange(cy_stc_ble_disc_range_info_t *charRangeInfo)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(charRangeInfo->connHandle);

    if(cy_ble_discovery[discIdx].servCount == (uint32_t)CY_BLE_SRVI_TPS)
    {
        if(charRangeInfo->srviIncIdx != CY_BLE_DISCOVERY_INIT)
        {
            cy_ble_discovery[discIdx].charCount++;
        }

        if(cy_ble_discovery[discIdx].charCount == 0u)
        {
            /* One descriptor is available per characteristic */
            charRangeInfo->range.startHandle = cy_ble_tpsc[discIdx].txPowerLevelChar.valueHandle + 1u;
            charRangeInfo->range.endHandle = cy_ble_serverInfo[discIdx][CY_BLE_SRVI_TPS].range.endHandle;
        }

        /* Indicate that request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
}


/******************************************************************************
* Function Name: Cy_BLE_TPSC_NotificationEventHandler
***************************************************************************//**
*
*  Handles the Notification Event for the Tx Power Service.
*
*  \param cy_stc_ble_gattc_handle_value_ntf_param_t *eventParam: The pointer to the data
*                                                     structure specified by the event.
*
******************************************************************************/
static void Cy_BLE_TPSC_NotificationEventHandler(cy_stc_ble_gattc_handle_value_ntf_param_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_TPS_ApplCallback != NULL))
    {
        if(cy_ble_tpsc[discIdx].txPowerLevelChar.valueHandle == eventParam->handleValPair.attrHandle)
        {
            cy_stc_ble_tps_char_value_t ntfParam =
            {
                .connHandle = eventParam->connHandle,
                .charIndex  = CY_BLE_TPS_TX_POWER_LEVEL,
                .value      = &eventParam->handleValPair.value
            };
            Cy_BLE_TPS_ApplCallback((uint32_t)CY_BLE_EVT_TPSC_NOTIFICATION, (void*)&ntfParam);
            cy_ble_eventHandlerFlag &= (uint8_t)(~CY_BLE_CALLBACK);
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_TPSC_ReadResponseEventHandler
***************************************************************************//**
*
*  Handles the Read Response Event.
*
*  \param cy_stc_ble_gattc_read_rsp_param_t *eventParam: The pointer to the data that came
*                                             with a read response for the Tx
*                                             Power Service.
*
******************************************************************************/
static void Cy_BLE_TPSC_ReadResponseEventHandler(cy_stc_ble_gattc_read_rsp_param_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_TPS_ApplCallback != NULL) &&
       (cy_ble_tpscReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        if(cy_ble_tpsc[discIdx].txPowerLevelChar.valueHandle == cy_ble_tpscReqHandle[discIdx])
        {
            /* Fill Tx Power Service read response parameter structure for Tx Power Level
             * Characteristic. */
            cy_stc_ble_tps_char_value_t rdRspParam =
            {
                .connHandle = eventParam->connHandle,
                .charIndex  = CY_BLE_TPS_TX_POWER_LEVEL,
                .value      = &eventParam->value
            };
            cy_ble_tpscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
            Cy_BLE_TPS_ApplCallback((uint32_t)CY_BLE_EVT_TPSC_READ_CHAR_RESPONSE, &rdRspParam);
        }
        else if(cy_ble_tpsc[discIdx].txPowerLevelCccdHandle == cy_ble_tpscReqHandle[discIdx])
        {
            /* Fill Tx Power Service read response parameter structure for Tx Power Level
             * Client Characteristic Configuration Descriptor. */
            cy_stc_ble_tps_descr_value_t rdRspParam =
            {
                .connHandle = eventParam->connHandle,
                .charIndex  = CY_BLE_TPS_TX_POWER_LEVEL,
                .descrIndex = CY_BLE_TPS_CCCD,
                .value      = &eventParam->value
            };
            cy_ble_tpscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
            Cy_BLE_TPS_ApplCallback((uint32_t)CY_BLE_EVT_TPSC_READ_DESCR_RESPONSE, &rdRspParam);
        }
        else
        {
            /* No TPS characteristic was requested for read */
        }
    }
}


